![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png)

# <center> LESSON 5: Introduction to PANDAS </center>

## 1. INTRODUCTION

### 1.1 What is Pandas?

`Pandas = Panel Data`

### 1.2 Installation

- Cài đặt khi tạo môi trường ảo:
```
conda create -n hanh python=3.7 pandas
```
- Cài đặt sau khi tạo xong môi trường ảo:
```
conda install pandas
```
hoặc 
```
pip install pandas
```

### 1.3 Import

In [1]:
import pandas as pd

**Reference**: 
- [Pandas Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
- [Python for Data Analysis](https://bedford-computing.co.uk/learning/wp-content/uploads/2015/10/Python-for-Data-Analysis.pdf)

## 2. BASICS

### 2.1 Objects in Pandas

- **DataFrame**: table, `pd.DataFrame()`
- **Series**: column, `pd.Series()`

![](https://media.geeksforgeeks.org/wp-content/cdn-uploads/creating_dataframe1.png)
![](https://analyticssavvy.com/wp-content/uploads/2020/05/series-and-dataframe.png)

#### 2.1.1 How to create a DataFrame

1. Tạo ra 1 DataFrame rỗng

2. Tạo ra 1 DataFrame từ dict

3. Tạo ra 1 DataFrame từ list của list

4. Tạo ra 1 DataFrame từ zip

5. Tạo từ 1 chuỗi numpy

#### 2.1.2 How to create a Series

### 2.2 I/O

Link: https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data

### 2.3 Indexing

Chọn tất cả các dòng (slicing):
- `loc`: location `df.loc[row_label,col_label]`, `series.loc[row_label]`
- `iloc`: index location `df.iloc[row_index,col_index]`, `series.iloc[row_index]`

Chọn 1 cell:
- `at`:  `df.at[row_label,col_label]`
- `iat`: `df.iat[row_index,col_index]`

In [2]:
import seaborn as sns

In [3]:
tips_df = sns.load_dataset('tips')
tips_df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
tips_df.loc[1,'total_bill']

10.34

In [7]:
tips_df.iloc[1,0]

10.34

In [8]:
tips_df.at[1, 'total_bill']

10.34

In [9]:
tips_df.iat[1,0]

10.34

In [11]:
tips_df.loc[:4,'total_bill':'sex']

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [15]:
tips_df.iloc[:5,:3]

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [16]:
tips_df['total_bill'].to_frame()

     total_bill
0         16.99
1         10.34
2         21.01
3         23.68
4         24.59
..          ...
239       29.03
240       27.18
241       22.67
242       17.82
243       18.78

[244 rows x 1 columns]

In [17]:
tips_df[['total_bill']]

     total_bill
0         16.99
1         10.34
2         21.01
3         23.68
4         24.59
..          ...
239       29.03
240       27.18
241       22.67
242       17.82
243       18.78

[244 rows x 1 columns]

In [19]:
tips_df.iloc[3:5,:6]

   total_bill   tip     sex smoker  day    time
3       23.68  3.31    Male     No  Sun  Dinner
4       24.59  3.61  Female     No  Sun  Dinner

In [25]:
# pd.options.display.max_rows = 10
pd.options.display.max_columns=10
tips_df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

### 2.4 Masking

In [26]:
tips_df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

tips_df.loc[]
tips_df[]
tips_df.query()

In [28]:
tips_df.loc[tips_df['sex'] == 'Female'].head(3)

    total_bill   tip     sex smoker  day    time  size
0        16.99  1.01  Female     No  Sun  Dinner     2
4        24.59  3.61  Female     No  Sun  Dinner     4
11       35.26  5.00  Female     No  Sun  Dinner     4

In [29]:
tips_df[tips_df['sex'] == 'Female'].head(3)

    total_bill   tip     sex smoker  day    time  size
0        16.99  1.01  Female     No  Sun  Dinner     2
4        24.59  3.61  Female     No  Sun  Dinner     4
11       35.26  5.00  Female     No  Sun  Dinner     4

In [30]:
tips_df.query("sex == 'Female'").head(3)

    total_bill   tip     sex smoker  day    time  size
0        16.99  1.01  Female     No  Sun  Dinner     2
4        24.59  3.61  Female     No  Sun  Dinner     4
11       35.26  5.00  Female     No  Sun  Dinner     4

In [31]:
tips_df.query(("sex == 'Female'") and ("smoker == 'Yes'")).head(3)

    total_bill   tip   sex smoker  day    time  size
56       38.01  3.00  Male    Yes  Sat  Dinner     4
58       11.24  1.76  Male    Yes  Sat  Dinner     2
60       20.29  3.21  Male    Yes  Sat  Dinner     2

In [36]:
condition = (tips_df['total_bill'] > 10) & (tips_df['sex'] == 'Male')
tips_df.loc[condition]

     total_bill   tip   sex smoker  day    time  size
1         10.34  1.66  Male     No  Sun  Dinner     3
2         21.01  3.50  Male     No  Sun  Dinner     3
3         23.68  3.31  Male     No  Sun  Dinner     2
5         25.29  4.71  Male     No  Sun  Dinner     4
7         26.88  3.12  Male     No  Sun  Dinner     4
..          ...   ...   ...    ...  ...     ...   ...
236       12.60  1.00  Male    Yes  Sat  Dinner     2
237       32.83  1.17  Male    Yes  Sat  Dinner     2
239       29.03  5.92  Male     No  Sat  Dinner     3
241       22.67  2.00  Male    Yes  Sat  Dinner     2
242       17.82  1.75  Male     No  Sat  Dinner     2

[146 rows x 7 columns]

In [37]:
condition = (tips_df['smoker'] == 'No') & (tips_df['size'] >= 3)
tips_df.loc[condition]

     total_bill   tip     sex smoker  day    time  size
1         10.34  1.66    Male     No  Sun  Dinner     3
2         21.01  3.50    Male     No  Sun  Dinner     3
4         24.59  3.61  Female     No  Sun  Dinner     4
5         25.29  4.71    Male     No  Sun  Dinner     4
7         26.88  3.12    Male     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
212       48.33  9.00    Male     No  Sat  Dinner     4
223       15.98  3.00  Female     No  Fri   Lunch     3
227       20.45  3.00    Male     No  Sat  Dinner     4
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3

[59 rows x 7 columns]

In [49]:
condition = (tips_df['sex'] == 'Female') & ((tips_df['day'] == 'Sun')|(tips_df['day'] == 'Sat')) & (tips_df['tip'] >= 5) & (tips_df['time'] == 'Dinner')
tips_df.loc[condition]

     total_bill   tip     sex smoker  day    time  size
11        35.26  5.00  Female     No  Sun  Dinner     4
52        34.81  5.20  Female     No  Sun  Dinner     4
73        25.28  5.00  Female    Yes  Sat  Dinner     2
155       29.85  5.14  Female     No  Sun  Dinner     5
214       28.17  6.50  Female    Yes  Sat  Dinner     3

In [50]:
condition = ("sex == 'Female' & time == 'Dinner' & day == ['Sat','Sun'] & tip >= 5")
tips_df.query(condition)

     total_bill   tip     sex smoker  day    time  size
11        35.26  5.00  Female     No  Sun  Dinner     4
52        34.81  5.20  Female     No  Sun  Dinner     4
73        25.28  5.00  Female    Yes  Sat  Dinner     2
155       29.85  5.14  Female     No  Sun  Dinner     5
214       28.17  6.50  Female    Yes  Sat  Dinner     3

### 2.5 Operations

#### 2.5.1 Groupby

![](https://blog.dask.org/images/split-apply-combine.png)

In [53]:
tips_df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [54]:
tips_df.groupby('sex').total_bill.mean()

sex
Male      20.744076
Female    18.056897
Name: total_bill, dtype: float64

In [55]:
tips_df['total_bill_tip'] = tips_df['total_bill'] + tips_df['tip']
tips_df.head(3)

   total_bill   tip     sex smoker  day    time  size  total_bill_tip
0       16.99  1.01  Female     No  Sun  Dinner     2           18.00
1       10.34  1.66    Male     No  Sun  Dinner     3           12.00
2       21.01  3.50    Male     No  Sun  Dinner     3           24.51

In [57]:
tips_df.groupby('sex').total_bill_tip.mean().to_frame()

        total_bill_tip
sex
Male         23.833694
Female       20.890345

In [59]:
tips_df.groupby('sex').agg({'total_bill':['max','min','mean'], 'tip':['max','min','mean']})

       total_bill                    tip
              max   min       mean   max  min      mean
sex
Male        50.81  7.25  20.744076  10.0  1.0  3.089618
Female      44.30  3.07  18.056897   6.5  1.0  2.833448

In [61]:
tips_df.groupby('sex').agg(mean_total_bill_tip=('total_bill_tip','mean'), mean_total_bill=('total_bill','mean'))

        mean_total_bill_tip  mean_total_bill
sex
Male              23.833694        20.744076
Female            20.890345        18.056897

In [62]:
tips_df.groupby('time').agg(Tong_doanh_thu=('total_bill_tip','sum'))

        Tong_doanh_thu
time
Lunch          1352.98
Dinner         4206.37

In [63]:
condition = ("smoker == 'No' & day == 'Sun'")
tips_df.query(condition).groupby('time').agg(Tong_doanh_thu=('total_bill','sum'))

        Tong_doanh_thu
time
Lunch             0.00
Dinner         1168.88

#### 2.5.2 Pivot

#### 2.5.3 Others

|Merge methods| SQL Join Name | Meaning| _merge|
|-|-|-|-|
|left| LEFT OUTER JOIN|Chỉ sử dụng keys bên trái|left_only|
|right| RIGHT OUTER JOIN|Chỉ sử dụng keys bên phải|right_only|
|outer|FULL OUTER JOIN|Sử dụng keys của cả 2 dataframes|both|
|inner|INNER JOIN|Chỉ sử dụng keys giao nhau của 2 dataframes|both|

![](https://lh3.googleusercontent.com/-n76c6dtr5sw/YBO5d-3PzGI/AAAAAAAAAh8/xiT6YIzePLEXArb8uU1f1vgg8JRXYeg8ACLcBGAsYHQ/image.png)